# Pandas

In [ ]:
import pandas as pd
# read_csv is use for read csv files
df =pd.read_csv( "C:\\Users\\ayush\\OneDrive\\Desktop\\10 Hit Films.csv")
# df means dataFrame
df

,Sr.No,Name,Domestic Gross,Overseas Gross,Worldwide Gross,Domestic Nett,Verdict
0,1,Dangle,540.3 cr,1525.8 cr,2066.2 cr,380.5 cr,Industry Hit
1,2,Pathaan,647.5 cr,388 cr,1036 cr,535 cr,Hit
2,3,PK,448 cr,304 cr,752 cr,337 cr,Industry Hit
3,4,Sultan,421 cr,197 cr,618 cr,300 cr,Blockbuster
4,5,Sanju,439 cr,147 cr,587 cr,335 cr,Blockbuster
5,6,Padmaavat,395 cr,185 cr,227 cr,283 cr,Blockbuster
6,7,Dhoom 3,362 cr,192 cr,554 cr,260 cr,Industry Hit
7,8,War,378 cr,98 cr,475 cr,319 cr,Blockbuster
8,9,3-Idiots,274 cr,125 cr,400 cr,201 cr,Industry Hit
9,10,Krrish 3,320 cr,54 cr,374 cr,246 cr,Blockbuster

In [4]:
import pandas as pd
# read_csv is use for read csv files
df =pd.read_csv( "C:\\Users\\ayush\\OneDrive\\Desktop\\10 Hit Films.csv")
# df means dataFrame
df
df['Overseas Gross'] .max()

'     1525.8 cr'

In [5]:
df.head()# print only first 5 index rows means start with zero
df.head(2) # print only first 2 index rows

,Sr.No,Name,Domestic Gross,Overseas Gross,Worldwide Gross,Domestic Nett,Verdict
0,1,Dangle,540.3 cr,1525.8 cr,2066.2 cr,380.5 cr,Industry Hit
1,2,Pathaan,647.5 cr,388 cr,1036 cr,535 cr,Hit

In [6]:
df.tail()# print last 5 row

,Sr.No,Name,Domestic Gross,Overseas Gross,Worldwide Gross,Domestic Nett,Verdict
5,6,Padmaavat,395 cr,185 cr,227 cr,283 cr,Blockbuster
6,7,Dhoom 3,362 cr,192 cr,554 cr,260 cr,Industry Hit
7,8,War,378 cr,98 cr,475 cr,319 cr,Blockbuster
8,9,3-Idiots,274 cr,125 cr,400 cr,201 cr,Industry Hit
9,10,Krrish 3,320 cr,54 cr,374 cr,246 cr,Blockbuster

In [8]:
df.columns

Index(['Sr.No', '   Name', 'Domestic Gross', 'Overseas Gross',
       'Worldwide Gross', 'Domestic Nett', ' Verdict'],
      dtype='object')

In [14]:
df[['Domestic Gross']]# double squre bracket for 2-D

   Domestic Gross
0        540.3 cr
1        647.5 cr
2          448 cr
3          421 cr
4          439 cr
5          395 cr
6          362 cr
7         378 cr
8         274 cr
9         320 cr

In [16]:
df[['Domestic Gross','Worldwide Gross']] # access these two columns in data frame

   Domestic Gross Worldwide Gross
0        540.3 cr       2066.2 cr
1        647.5 cr         1036 cr
2          448 cr          752 cr
3          421 cr          618 cr
4          439 cr          587 cr
5          395 cr          227 cr
6          362 cr         554 cr
7         378 cr          475 cr
8         274 cr          400 cr
9         320 cr          374 cr

In [19]:
# operation perform of dataframe
df['Worldwide Gross'] . max() # Return

'     2066.2 cr'

In [21]:
df.describe()# show the statistics of data

          Sr.No
count  10.00000
mean    5.50000
std     3.02765
min     1.00000
25%     3.25000
50%     5.50000
75%     7.75000
max    10.00000

In [26]:
df[df.WorldwideGross > 600 cr]

SyntaxError: invalid syntax. Perhaps you forgot a comma? (4146767849.py, line 1)

In [29]:
df.set_index('Name')

KeyError: "None of ['Name'] are in the columns"